-- 1. Сделать запрос для получения атрибутов из указанных таблиц, применив фильтры по указанным условиям:
-- Таблицы: Н_ЛЮДИ, Н_ВЕДОМОСТИ.
-- Вывести атрибуты: Н_ЛЮДИ.ИМЯ, Н_ВЕДОМОСТИ.ДАТА.
-- Фильтры (AND):
-- a) Н_ЛЮДИ.ФАМИЛИЯ > Ёлкин.
-- b) Н_ВЕДОМОСТИ.ЧЛВК_ИД = 163249.
-- c) Н_ВЕДОМОСТИ.ЧЛВК_ИД = 153285.
-- Вид соединения: RIGHT JOIN.

create index  "ЛЮДИ_ФАМИЛИЯ_btree_ix" on "Н_ВЕДОМОСТИ" using btree ("ФАМИЛИЯ");
create index  "ВЕД_ЧЛВК_FK_IFK_btree_idx" on "Н_ВЕДОМОСТИ" using btree ("ЧЛВК_ИД");

EXPLAIN ANALYZE

SELECT "Н_ЛЮДИ"."ИМЯ", "Н_ВЕДОМОСТИ"."ДАТА"

    FROM "Н_ЛЮДИ" 
        RIGHT JOIN "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"

    WHERE "Н_ЛЮДИ"."ФАМИЛИЯ" > 'Ёлкин'
        AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = 163249
        AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = 153285;


-- 2. Сделать запрос для получения атрибутов из указанных таблиц, применив фильтры по указанным условиям:
-- Таблицы: Н_ЛЮДИ, Н_ВЕДОМОСТИ, Н_СЕССИЯ.
-- Вывести атрибуты: Н_ЛЮДИ.ИМЯ, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.ЧЛВК_ИД.
-- Фильтры (AND):
-- a) Н_ЛЮДИ.ФАМИЛИЯ > Иванов.
-- b) Н_ВЕДОМОСТИ.ЧЛВК_ИД > 142390.
-- Вид соединения: RIGHT JOIN.

create index  "ЛЮДИ_ФАМИЛИЯ_btree_idx" on "Н_ВЕДОМОСТИ" using btree ("ФАМИЛИЯ");
create index  "ВЕД_ЧЛВК_FK_hash_idx" on "Н_ВЕДОМОСТИ" using hash ("ЧЛВК_ИД");
create index  "СЕССИЯ_ЧЛВК_FK_btree_ix" on "Н_ВЕДОМОСТИ" using btree ("ЧЛВК_ИД");

EXPLAIN ANALYZE

SELECT "Н_ЛЮДИ"."ИМЯ", "Н_ВЕДОМОСТИ"."ЧЛВК_ИД", "Н_СЕССИЯ"."ЧЛВК_ИД"

    FROM "Н_ЛЮДИ" 
        RIGHT JOIN "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
        RIGHT JOIN "Н_СЕССИЯ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"

    WHERE "Н_ЛЮДИ"."ФАМИЛИЯ" > 'Иванов'
        AND "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = 142390;


